export const stagesList = [
  {
    title: 'Старт',
    content:
      'Первый месяц глубокой адаптации. Проверяем твои навыки, даём возможность донабрать теории, начинаем изучать командные взаимодействия и подготавливаемся к проекту.'
  },
  {
    title: 'Погружение в проект',
    content:
      'Со второго месяца у тебя появляется проект. Проект сложный, с настоящим заказчиком. Стажировка в таком цикле готовит тебя к сложным задачам.'
  },
  {
    title: 'Работа над проектом',
    content:
      'Каждый участник команды развивает компетенции по своем направлению, где ему помогают наставники. Они работают с вами как тимлиды: вникают в суть проекта, делают ревью вашей работы.'
  },
  {
    title: 'Защита проекта',
    content:
      'Все проекты будут презентованы на демо дне, куда мы пригласим представителей разных компаний. Это хороший шанс трудоустроиться, а самым лучшим мы  предложим работу после стажировки.'
  }
]
