export const tableData = [
  {
    name: 'Иванов И.И.',
    result: '96%',
    review: 'Хорошая работа, нравится структура ',
    status: 'Принят на стажировку'
  },
  {
    name: 'Иванов И.И.',
    result: '87%',
    review:
      'Хорошая работа, все четко и без ошибок, но есть маленький недочет, но все ок',
    status: 'Принят на стажировку'
  },
  {
    name: 'Иванов И.И.',
    result: '85%',
    review: 'Хорошая работа, нравится структура ',
    status: 'Принят на стажировку'
  },
  {
    name: 'Иванов И.И.',
    result: '83%',
    review:
      'Работа выполнена хорошо, видно, что хороший человек делал, с маленькими ошибками',
    status: 'Принят на стажировку'
  }
]
