export const descriptions = {
  'System Analyst':
    'Связующее звено между бизнес-потребностями и IT-решениями. Именно он анализирует требования.',
  'Project Manager':
    'Связующее звено между командой, заказчиком и бизнес-целями. Он планирует, координирует и контролирует выполнение задач, обеспечивая успешную реализацию проекта в срок и в рамках бюджета.',
  'QA Engineer':
    'Это профессионал, отвечающий за качество программного обеспечения. Главная задача QA-специалиста — находить ошибки и недочеты до того, как продукт попадет к пользователю.',
  'UI/UX Designer':
    'Специалист, который отвечает за создание удобных и эстетичных интерфейсов для пользователей.',
  Backend:
    'Отвечает за серверную логику и взаимодействие с базами данных, разрабатывая API и настраивая интеграции.',
  Frontend:
    'Cпециалист, который занимается созданием интерфейса приложения, с которым взаимодействует пользователь. Он реализует визуальные элементы, структуру и функциональность.',
  CEO: 'Специалист, определяет стратегическое направление компании, управляя бизнес-процессами и принимая ключевые решения.'
}

export const requirements = {
  'System Analyst': [
    'Знание методов сбора и анализа требований (интервью, анкетирование, моделирование)',
    'Опыт работы с UML и другими методами визуализации требований и процессов',
    'Умение разрабатывать техническую документацию',
    'Знание основ проектирования баз данных и работы с SQL',
    'Отличные аналитические способности и внимание к деталям',
    'Умение объяснять сложные технические концепции на доступном языке'
  ],
  'Project Manager': [
    'Знание методологий управления проектам (Agile, Scrum, Waterfall)',
    'Умение разрабатывать и поддерживать проектную документацию',
    'Знание основ управления ресурсами',
    'Опыт в управлении рисками и разрешении конфликтов'
  ],
  'QA Engineer': [
    'Знание инструментов тестирования (Postman, Swagger)',
    'Понимание работы методологий разработки ПО (Agile, Scrum)',
    'Знание методов и техник тестирования',
    'Понимание принципов работы с API',
    'Основы написания тест-кейсов и чек-листов',
    'Способность грамотно описывать тест-кейсы, составлять чек-листы и баг-репорты '
  ],
  'UI/UX Designer': [
    'Умение учитывать потребности пользователей',
    'Знание инструментов дизайна (Figma, Adobe X или Sketch)',
    'Понимание принципов юзабилити, пользовательского опыта (UX)',
    'Знание основ типографики, цветовой теории и композиции',
    'Опыт создания прототипов и макетов',
    'Креативное мышление и способность генерировать новые идеи'
  ],
  Backend: [
    'Отличные аналитические способности и внимание к деталям',
    'Знание PHP и фреймворка Laravel',
    'Опыт работы с реляционными базами данных (MySQL, PostgreSQL)',
    'Знание RESTful API и принципов проектирования архитектуры',
    'Опыт работы с системами контроля версий (Git)',
    'Умение работать с пакетным менеджером Composer'
  ],
  Frontend: [
    'Отличные аналитические способности, внимание к деталям',
    'Знание JavaScript, HTML и CSS',
    'Опыт работы с библиотекой React',
    'Знание современных инструментов сборки проектов (Webpack, Vite)',
    'Опыт работы с системами контроля версий (Git)',
    'Знание методологий и принципов веб-разработки (ACSS, BEM, Mobile First)'
  ],
  CEO: [
    'Знание основ стратегического управления и бизнес-планирования',
    'Опыт работы с финансовыми показателями и понимание бухгалтерского учёта',
    'Знание принципов маркетинга и продаж',
    'Опыт работы с инструментами аналитики и управления проектами',
    'Умение проводить анализ конкурентной среды и разрабатывать стратегии роста',
    'Умение принимать решения на основе данных'
  ]
}

export const tasks = {
  'System Analyst': [
    'Анализ бизнес-процессов',
    'Интервью с заказчиками',
    'Документирование требований',
    'Сбор и анализ требований',
    'Моделирование процессов',
    'Введение документации проекта',
    'Грамотное построение работы с разработчиками'
  ],
  'Project Manager': [
    'Организация встреч и проектных мероприятий',
    'Координация команды и контроль задач',
    'Взаимодействие с клиентами',
    'Оценка рисков и разработка стратегий',
    'Подготовка отчетов о ходе проекта'
  ],
  'QA Engineer': [
    'Разработка тестовой документации',
    'Проведение ручного тестирования',
    'Проведение автоматизированного тестирования',
    'Документация багов',
    'Взаимодействие с командой для решения проблем'
  ],
  'UI/UX Designer': [
    'Разрабатывать пользовательские интерфейсы',
    'Создавать интерактивные макеты',
    'Проводить исследования пользователей',
    'Анализировать поведение пользователей',
    'Взаимодействовать с командой разработчиков для реализации дизайна'
  ],
  Backend: [
    'Разработка серверной логики',
    'Работа с базами данных',
    'Реализация и оптимизация RESTful API',
    'Проведение код-ревью, участие в командных встречах',
    'Участие в проектировании архитектуры и выборе технологий'
  ],
  Frontend: [
    'Работа с адаптивной версткой',
    'Работа с кросс-браузерной совместимостью',
    'Реализация интерактивных элементов и анимаций',
    'Разработка и поддержка пользовательского интерфейса',
    'Проведение код-ревью, участие в обсуждениях дизайна',
    'Участие в проектировании UX и юзабилити-тестировании.'
  ],
  CEO: [
    'Управление командой, координация работы подразделений',
    'Участие в принятии ключевых решений по продуктам и услугам',
    'Разработка стратегии развития IT стартапа',
    'Адаптация бизнес-стратегий',
    'Анализ рыночных тенденций'
  ]
}
