import { TableFinalType } from './types'

export const tableFinalData: TableFinalType[] = [
  {
    id: 1,
    table: 'select',
    isSelected: false,
    name: 'Иванов И.И.',
    result: '90%',
    status: 'Принят на стажировку',
    comment:
      'Хорошая работа, вроде все ок. Сделано все качественно, человек понимает суть профессии и свои задачи. Есть мелкие нюансы, но не страшно'
  },
  {
    id: 2,
    table: 'select',
    isSelected: false,
    name: 'Иванов И.И.',
    result: '90%',
    status: 'Принят на стажировку',
    comment:
      'Хорошая работа, вроде все ок. Сделано все качественно, человек понимает суть профессии и свои задачи. Есть мелкие нюансы, но не страшно'
  },
  {
    id: 3,
    table: 'select',
    isSelected: false,
    name: 'Иванов И.И.',
    result: '90%',
    status: 'Принят на стажировку',
    comment:
      'Хорошая работа, вроде все ок. Сделано все качественно, человек понимает суть профессии и свои задачи. Есть мелкие нюансы, но не страшно'
  },
  {
    id: 4,
    table: 'select',
    isSelected: false,
    name: 'Иванов И.И.',
    result: '90%',
    status: 'Принят на стажировку',
    comment:
      'Хорошая работа, вроде все ок. Сделано все качественно, человек понимает суть профессии и свои задачи. Есть мелкие нюансы, но не страшно'
  },
  {
    id: 5,
    table: 'select',
    isSelected: false,
    name: 'Иванов И.И.',
    result: '90%',
    status: 'Принят на стажировку',
    comment:
      'Хорошая работа, вроде все ок. Сделано все качественно, человек понимает суть профессии и свои задачи. Есть мелкие нюансы, но не страшно'
  }
]
